app/controllers/game_types_controller.rb

  def index
    @game_types = GameType.all
---
SELECT "game_types".* FROM "game_types"

  def create
    @game_type = GameType.new(game_type_params)

    respond_to do |format|
      if @game_type.save
---
INSERT INTO "game_types" ("game_type", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game_type", "reqular"], ["created_at", 2017-01-28 16:44:00 UTC], ["updated_at", 2017-01-28 16:44:00 UTC]]

  def update
    respond_to do |format|
      if @game_type.update(game_type_params)
---
UPDATE "game_types" SET "game_type" = $1, "updated_at" = $2 WHERE "game_types"."id" = $3  [["game_type", "regular"], ["updated_at", 2017-01-28 16:44:10 UTC], ["id", 1]]

    def set_game_type
      @game_type = GameType.find(params[:id])
---
SELECT  "game_types".* FROM "game_types" WHERE "game_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]