app/controllers/leagues_controller.rb

  def create
    @league = League.new(league_params)

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bhakundo Amerocano"], ["created_at", 2017-01-28 16:27:39 UTC], ["updated_at", 2017-01-28 16:27:39 UTC]]

  def update
    respond_to do |format|
      if @league.update(league_params)
---
UPDATE "leagues" SET "name" = $1, "updated_at" = $2 WHERE "leagues"."id" = $3  [["name", "Bhakundo Americano"], ["updated_at", 2017-01-28 16:27:56 UTC], ["id", 1]]

    def set_league
      @league = League.find(params[:id])
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]