app/controllers/weeks_controller.rb

SELECT "weeks".* FROM "weeks"
---
  def index
    @weeks = Week.all

INSERT INTO "weeks" ("week_number", "week_starts_at", "week_ends_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["week_number", 1], ["week_starts_at", 2017-01-26 00:00:00 UTC], ["week_ends_at", 2017-02-01 23:59:00 UTC], ["created_at", 2017-01-28 17:19:30 UTC], ["updated_at", 2017-01-28 17:19:30 UTC]]
---
  def create
    @week = Week.new(week_params)

    respond_to do |format|
      if @week.save

SELECT  "weeks".* FROM "weeks" WHERE "weeks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_week
      @week = Week.find(params[:id])